//===========================================================================//
//                                                                           //
// 文件：  ICMP.C                                                            //
// 说明：  BW-DK5438开发板ICMP协议程序头文件                                 //
// 编译：  IAR Embedded Workbench IDE for MSP430 v4.21                       //
// 版本：  v1.1                                                              //
// 编写：  JASON.ZHANG                                                       //
// 版权：  北京拓普博维电子技术有限公司                                      //
// 日期：  2010.09.25                                                        //
//                                                                           //
//===========================================================================//


#ifndef _icmp_h_
#define	_icmp_h_

void ping_answer(void);

#endif
